In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

# 1st question

In [5]:
df1=df['FlightNumber'].isnull()
for i in range(0,len(df1)):
    if i==0:
        if df1.loc[i]==True:
            df['FlightNumber'].loc[i]=(df['FlightNumber'].loc[i])-10.0
    if df1.loc[i]==True:
        df['FlightNumber'].loc[i]=(df['FlightNumber'].loc[i-1])+10.0

C:\Users\surface pro\Anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [6]:
df=df.astype({'FlightNumber':int})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [7]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [8]:
df1=df.copy()

In [9]:
df1

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2nd question

In [10]:
df1['From']=df1['From_To'].apply(lambda x:x.split('_')[0])
df1['To']=df1['From_To'].apply(lambda x:x.split('_')[1])
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

# 4th question

In [11]:
df1.drop(columns='From_To',axis=1,inplace=True)

In [12]:
df3=df1.copy()

In [13]:
df3

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

# 3rd question

In [14]:
for i in range(0,len(df3['From'])):
    a1=df3['From'].loc[i]
    s=[]
    s1=''
    s.append(a1[0].upper())
    for j in range(1,len(a1)):
        s.append(a1[j].lower())
    s1=''.join(s)
    df3['From'].loc[i]=s1

C:\Users\surface pro\Anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [15]:
for i in range(0,len(df3['To'])):
    a1=df3['To'].loc[i]
    s=[]
    s1=''
    s.append(a1[0].upper())
    for j in range(1,len(a1)):
        s.append(a1[j].lower())
    s1=''.join(s)
    df3['To'].loc[i]=s1

In [16]:
df4=df3.copy()

In [17]:
df4

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [18]:
df5=df3.copy()

# 5th question start

In [19]:
s=[]
for i in range(0,len(df5['RecentDelays']) ):
    s.append(len(df5['RecentDelays'].loc[i]))

for i in range(0,max(s)):
    df5['Delay_'+' '+str(i)]=''

In [20]:
df5

,FlightNumber,RecentDelays,Airline,From,To,Delay_ 0,Delay_ 1,Delay_ 2
0,10045,"[23, 47]",KLM(!),London,Paris,,,
1,10055,[],<Air France> (12),Madrid,Milan,,,
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,,,
3,10075,[13],12. Air France,Budapest,Paris,,,
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,,,

In [21]:
for i in range(0,5):
    #print(i,'i')
    if len(df5['RecentDelays'].loc[i])==0:
        df5['Delay_ 0'].loc[i]='No Delay Yet'
        df5['Delay_ 1'].loc[i]='No Delay Yet'
        df5['Delay_ 2'].loc[i]='No Delay Yet'
        
    for j in range(0,len(df5['RecentDelays'].loc[i])):
        if j==0:
            df5['Delay_ 0'].loc[i]=df5['RecentDelays'].loc[i][j]
            print(df5['RecentDelays'].loc[i][j])
        if j==1:
            df5['Delay_ 1'].loc[i]=df5['RecentDelays'].loc[i][j]
            print(df5['RecentDelays'].loc[i][j])
        if j==2:
            df5['Delay_ 2'].loc[i]=df5['RecentDelays'].loc[i][j]
            print(df5['RecentDelays'].loc[i][j])

23
47
24
43
87
13
67
32

C:\Users\surface pro\Anaconda3\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [22]:
df5

,FlightNumber,RecentDelays,Airline,From,To,Delay_ 0,Delay_ 1,Delay_ 2
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,
1,10055,[],<Air France> (12),Madrid,Milan,No Delay Yet,No Delay Yet,No Delay Yet
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,,
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,

In [23]:
df5.drop(columns='RecentDelays',axis=1,inplace=True)

In [24]:
df5

,FlightNumber,Airline,From,To,Delay_ 0,Delay_ 1,Delay_ 2
0,10045,KLM(!),London,Paris,23,47,
1,10055,<Air France> (12),Madrid,Milan,No Delay Yet,No Delay Yet,No Delay Yet
2,10065,(British Airways. ),London,Stockholm,24,43,87
3,10075,12. Air France,Budapest,Paris,13,,
4,10085,"""Swiss Air""",Brussels,London,67,32,